[
  {
    "id": "a1781538-b242-4d25-8893-0530e9640b52",
    "user_id": "3f56efc4-d548-4696-9a8a-aa636a60c5eb",
    "scope": "client",
    "client_id": "techstart-solutions",
    "project_id": null,
    "task_id": null,
    "source_department": "marketing",
    "category": "image",
    "title": "Screenshot 2025-11-18 at 4.55.06 PM",
    "description": null,
    "tags": [],
    "file_path": "3f56efc4-d548-4696-9a8a-aa636a60c5eb/techstart-solutions/1764155094176_Screenshot_2025-11-18_at_4.55.06_PM.png",
    "external_url": null,
    "file_name": "Screenshot 2025-11-18 at 4.55.06 PM.png",
    "file_size": 156375,
    "mime_type": "image/png",
    "metadata": {},
    "is_pinned": false,
    "is_archived": false,
    "created_at": "2025-11-26T11:04:56.912619+00:00",
    "updated_at": "2025-11-28T08:00:19.963104+00:00",
    "google_file_name": null,
    "google_store_id": null,
    "indexing_status": "indexed",
    "google_error": null,
    "google_search_indexed": true,
    "google_search_indexed_at": "2025-11-28T08:00:19.768+00:00"
  },
  {
    "id": "d033c589-136f-4c89-817c-81712348eb59",
    "user_id": "3f56efc4-d548-4696-9a8a-aa636a60c5eb",
    "scope": "client",
    "client_id": "techstart-solutions",
    "project_id": null,
    "task_id": null,
    "source_department": "marketing",
    "category": "document",
    "title": "Andromeda",
    "description": null,
    "tags": [],
    "file_path": null,
    "external_url": "https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/",
    "file_name": null,
    "file_size": null,
    "mime_type": null,
    "metadata": {
      "scraped_at": "2025-11-26T17:44:47.429Z",
      "scraped_markdown": "[Skip to content](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/#content)\n\n![](https://engineering.fb.com/wp-content/uploads/2024/12/Andromeda-Blog-Hero_small.png)\n\nBy [Chonglin Sun](https://engineering.fb.com/author/chonglin-sun/ \"Posts by Chonglin Sun\"), [Nancy Yu](https://engineering.fb.com/author/nancy-yu/ \"Posts by Nancy Yu\"), [Haiyu Lu](https://engineering.fb.com/author/haiyu-lu/ \"Posts by Haiyu Lu\"), [Liang Wang](https://engineering.fb.com/author/liang-wang/ \"Posts by Liang Wang\"), [Yunchen Pu](https://engineering.fb.com/author/yunchen-pu/ \"Posts by Yunchen Pu\"), [Gaoxiang Liu](https://engineering.fb.com/author/gaoxiang-liu/ \"Posts by Gaoxiang Liu\"), [Gian-Paolo (GP) Musumeci](https://engineering.fb.com/author/gian-paolo-gp-musumeci/ \"Posts by Gian-Paolo (GP) Musumeci\"), [Neeraj Bhatia](https://engineering.fb.com/author/neeraj-bhatia/ \"Posts by Neeraj Bhatia\")\n\n- Andromeda is Meta’s proprietary machine learning (ML) system design for retrieval in ad recommendation focused on delivering a step-function improvement in value to our advertisers and people.\n- This system pushes the boundary of cutting edge AI for retrieval withNVIDIA Grace HopperSuperchip and [Meta Training and Inference Accelerator (MTIA)](https://ai.meta.com/blog/next-generation-meta-training-inference-accelerator-AI-MTIA/) hardware through innovations in ML model architecture, feature representation, learning algorithm, indexing, and inference paradigm.\n- We’re sharing how Andromeda establishes an efficient scaling law for retrieval by harnessing the power of state-of-the-art deep neural networks, benefitting from the co-design of ML, system, and hardware (NVIDIA and MTIA chips) that improves performance and return on investment.\n\nAI plays an important role in Meta’s advertising [system](https://www.facebook.com/business/news/good-questions-real-answers-how-does-facebook-use-machine-learning-to-deliver-ads) by leveraging the power of machine learning (ML) to predict which ads a person will find most interesting. This helps people learn about a business or product they are interested in while helping an advertiser meet their objectives such as increasing brand awareness, acquiring new customers, and driving sales.\n\nRetrieval is the first step in our multi-stage ads recommendation system. This stage is tasked with selecting ads from tens of millions of ad candidates into a few thousand relevant ad candidates. In the following stage, larger and more sophisticated ranking models predict people and advertiser value to determine the final set of ads to be shown to the person.\n\n## Challenges and opportunities in this new era of advertiser automation with generative AI\n\nThe retrieval stage is challenging primarily because of scalability constraints in two axes: volume of ad candidates and tight latency constraints.\n\n**Volume of ad candidates:** Retrieval processes three orders of magnitude more ads than subsequent stages. Features like predictive targeting, which dramatically improve advertiser outcomes, are computationally expensive. The continued positive momentum of Meta’s [Advantage+](https://www.facebook.com/business/help/397103717129942?id=1913105122334058&content_id=YAvwvDmp3OKQagl&ref=sem_smb&utm_term=dsa-1720753164846&gclid=Cj0KCQjw1Yy5BhD-ARIsAI0RbXYPq9-cjHq5qekJJW6O98EqjXQu8GZjHIsq-1VEFWFwXD37coGHgE4aAu_KEALw_wcB&gad_source=1) suite further increases the number of eligible ads through [automation](https://www.facebook.com/business/ads/automation) of audience creation, optimal budget allocation, dynamic placement across Meta surfaces, and creative generation. Finally, with the adoption of powerful new tools based on generative AI for creating and optimizing ad creative content, the number of ads creatives in Meta’s recommendation systems is expected to grow significantly.\n\n**Tight latency constraints:** Selecting ads rapidly is essential for delivering timely and relevant ads, as any delay can disrupt the viewers experience by not providing the most current content. As advertising becomes increasingly dynamic, frequent updates to both delivery and each person’s interests demand increased model complexity in near real-time.\n\nProcessing such a vast number of ads in so little time is capacity intensive, which requires substantial optimization and innovation to scale up model complexity for better personalization while maintaining a high return on investment (ROI) on the required infrastructure investments.\n\n## Unlocking advertiser value through industry-leading ML innovation\n\nMeta Andromeda is a personalized ads retrieval engine that leverages the NVIDIA Grace Hopper Superchip, to enable cutting edge ML innovation in the Ads retrieval stage to drive efficiency and advertiser performance. Key AI advancements include:\n\n### Deep neural networks custom-designed for the NVIDIA Grace Hopper Superchip to deliver superior performance\n\nAndromeda improves performance of Meta ads system by delivering more personalized ads to viewers and maximizing return on ad spend for advertisers. Meta’s Ads team has created a deep neural network with increased compute complexity and massive parallelism on the NVIDIA Grace Hopper Superchip to better learn higher-order interactions from people and ads data. Its deployment across Instagram and Facebook applications has achieved +6% recall improvement to the retrieval system, delivering +8% [ads quality](https://www.facebook.com/business/help/1767120243598011) improvement on selected segments.\n\n### Hierarchical indexing to support exponential ad creatives growth from Advantage+ creative\n\nAdvantage+ automates budget allocation, audience targeting, and bid adjustments – streamlining campaign management and boosting performance through more ads in the system for different audiences.\n\nFor example, when advertisers who did not previously use Advantage+ creative turned on its AI-driven targeting features, they experienced a 22% increase in ROAS from our ads. We estimate that businesses using image generation are seeing a +7% increase in conversions. Even at this early stage, more than a million advertisers used our generative AI (GenAI) tools to create more than 15 million ads in a month. Andromeda is designed to maximize ads performance by utilizing the exponential growth in volume of eligible ads available to the retrieval stage. It introduces an efficient hierarchical index to scale up to a large volume of ads creatives, empowering the adoption of GenAI technologies by advertisers.\n\n### AI development efficiency\n\nAndromeda reduces system complexity by minimizing components and rule-based logic, allowing for end-to-end performance optimization. This streamlined system enhances pace of adoption for future AI innovation in the retrieval space.\n\n## Meta’s new personalized ads retrieval paradigm\n\nBefore Andromeda, Meta’s retrieval systems were only able to apply limited personalization, relying on a process with isolated model stages and numerous rule-based heuristics to manage the vast number of ads. This approach hindered end-to-end optimization and efficient global resource allocation to maximize performance. Handling such a massive volume of ads per request was complex, memory bandwidth-intensive, and difficult to scale, resulting in low hardware-level parallelism in conventional retrieval models. This often led to suboptimal performance and slower adoption of AI innovations.\n\n![](https://engineering.fb.com/wp-content/uploads/2024/12/Personalized-Ads-Retrieval-Paradigm-Final.png?w=1024)\n\nAndromeda represents a significant technological leap in retrieval – addressing the above challenges with key ML and system innovations.\n\n### A state-of-the-art deep neural network for retrieval\n\nAndromeda is able to efficiently scale retrieval models by designing a highly customized deep neural network with sublinear inference cost, enabling a meaningful increase of model capacity (10,000x) for enhanced personalization. Complex latent relationships between people’s interests, products, and services offered through ads are captured through advanced interaction features and new algorithms, further enhancing recommendation relevance and accuracy.\n\nThe design is optimized for AI hardware, minimizing memory bandwidth bottlenecks and enabling highly parallel, computation-intensive retrieval models with high performance. GPU preprocessing is used for feature extraction, and all precomputed ad embeddings and features are stored in the local memory of the Grace Hopper Superchip. This approach addresses the traditional scaling constraints of limited CPU-to-GPU interconnect bandwidth, heavy memory IO overhead, and low GPU utilization and enables efficient handling of a larger set of diverse feature inputs.\n\n### Hierarchical indexing for efficiency and scalable retrieval\n\nAndromeda organizes ads into a hierarchical index with multiple layers, reducing the number of inference steps by focusing only on most relevant nodes. The hierarchical index and retrieval models are jointly trained, which aligns the index representations with neural networks; this improves both precision and recall compared to commonly used two-tower neural networks or approximate nearest neighbor search.\n\nThe hierarchical structured neural network provides sub-linear inference costs, enabling retrieval models to scale up to much higher capacity, allowing efficient handling of a larger volume of ads with high retrieval accuracy while achieving higher performance.\n\n### Model elasticity\n\nAndromeda enhances overall system ROI by enabling agile and efficient resource allocation. A segment-aware design leverages higher complexity models to serve high value ads segments to maximize ROI. It automatically adjusts model complexity and inference steps in real-time based on available resources, thereby allowing a more scalable retrieval system. Together with a hierarchical structured neural network, model elasticity further boosts model inference efficiency by 10x.\n\n### An optimized retrieval model\n\nAndromeda significantly enhances the retrieval model’s instruction and thread-level parallelism through innovations in model architecture, features, learning algorithms, and the inference paradigm. This model is built with low-latency, high-throughput, and memory-IO aware GPU operators, utilizing deep kernel fusion and advanced software pipelining techniques. This minimizes kernel dispatching overhead, avoids bottlenecks on repeated HBM-SRAM memory IO, and reduces dependency on low arithmetic intensity modules.\n\nUnlike conventional retrieval models that rely on expert-engineered features, Andromeda leverages the NVIDIA Hopper GPU’s massive parallel computing capabilities to dynamically reconstruct latent user-ad interaction signals on-the-fly, achieving over 100x improvement in both feature extraction latency and throughput of previous CPU based components. In addition, the chip’s high-bandwidth CPU-GPU interconnection supercharges ads retrieval inference to process an enormous number of ads per request, enabling a faster and more efficient delivery of relevant and personalized Ads. The effort has enhanced end-to-end model inference queries per second (QPS) by over 3x.\n\n## Advancing the state of art in ads retrieval\n\nAndromeda significantly enhances Meta’s ads system by enabling the integration of AI that optimizes and improves personalization capabilities at the retrieval stage and improves return on ad spend. A hierarchical indexing solution leveraging deep neural networks co-designed with the NVIDIA Grace Hopper Superchip helps address the scalability challenges presented by the exponential growth of creatives while delivering the best experience given the strict latency and capacity ROI budgets. Andromeda capitalizes the fast industry adoption of Advantage+ automation and GenAI to deliver value for our advertisers, people who use our suite of products, and Meta.\n\nLooking forward, the Andromeda model architecture is expected to transition to support an autoregressive loss function, leading to a more efficient and faster inferencing solution that delivers a more diverse set of ad candidates. Increased ad diversity can improve people’s experience with ads and drive better advertiser outcomes.\n\nIntegrating Andromeda with MTIA and future generations of commercially-available GPUs will continue to push the boundaries of scaling retrieval – further improving advertiser performance and achieving what we estimate will be another 1,000x increase in model complexity.\n\n### Acknowledgements\n\n_We would like to thank Habiya Beg, Zain Brohi, Wenlin Chen, Yan Dong, Chunli Fu, Uday Garikipati, Golnaz Ghasemiesfeh, Xingfeng He, Akshay Hegde, Liquan Huang, Liuhan Huang, Kamran Izadi, Santosh Janardhan, Karthik Jayaraman, Changkyu Kim, Santanu Kolay, Ilia Lewis, Wenqian Li, Xiaotian Li, Rocky Liu, Paolo Massimi, Kexin Nie, Sandeep Pandey, Uladzimir Pashkevich, Alexander Petrov, Varna Puvvada, Hang Qu, Melanie Roe, Vibha Sinha, Yan Shi, Matt Steiner, Alisha Swinteck, Bangsheng Tang, Jim Tao, Sunay Vaishnav, Arunprasad Venkatraman, Vidhoon Viswanathan, Sasha Vorontsov, Minghui Wanghan, Fangzhou Xu, Nathan Yan, Tak Yan, Yang Yang, Qing Zhang, Fangyu Zou, and everyone who contributed to the success of Meta Andromeda._\n\n### Share this:\n\n- [Click to share on Facebook (Opens in new window)Facebook](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=facebook&nb=1)\n- [Click to share on Threads (Opens in new window)Threads](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=threads&nb=1)\n- [Click to share on WhatsApp (Opens in new window)WhatsApp](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=jetpack-whatsapp&nb=1)\n- [Click to share on LinkedIn (Opens in new window)LinkedIn](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=linkedin&nb=1)\n- [Click to share on Reddit (Opens in new window)Reddit](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=reddit&nb=1)\n- [Click to share on X (Opens in new window)X](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=x&nb=1)\n- [Click to share on Bluesky (Opens in new window)Bluesky](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=bluesky&nb=1)\n- [Click to share on Mastodon (Opens in new window)Mastodon](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=mastodon&nb=1)\n- [Click to share on Hacker News (Opens in new window)Hacker News](https://engineering.fb.com/2024/12/02/production-engineering/meta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine/?share=custom-1699562127&nb=1)\n- [Click to email a link to a friend (Opens in new window)Email](mailto:?subject=%5BShared%20Post%5D%20Meta%20Andromeda%3A%20Supercharging%20Advantage%2B%20automation%20with%20the%20next-gen%20personalized%20ads%20retrieval%20engine&body=https%3A%2F%2Fengineering.fb.com%2F2024%2F12%2F02%2Fproduction-engineering%2Fmeta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine%2F&share=email&nb=1)\n\nFacebook\n\n|     |     |     |\n| --- | --- | --- |\n| |     |     |     |\n| --- | --- | --- |\n| ![](https://static.xx.fbcdn.net/rsrc.php/v4/yD/r/FEppCFCt76d.png)Like | [Share](https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fengineering.fb.com%2F2024%2F12%2F02%2Fproduction-engineering%2Fmeta-andromeda-advantage-automation-next-gen-personalized-ads-retrieval-engine%2F&display=popup&ref=plugin&src=like&kid_directed_site=0) | You and 364 others like this.                               364 people like this.[Sign Up](https://www.facebook.com/ad_campaign/landing.php?campaign_id=137675572948107&partner_id=engineering.fb.com&placement=like_plugin&extra_1=https%3A%2F%2Fengineering.fb.com%2F&extra_2=US) to see what your friends like. | |\n\n[![Sequence learning: A paradigm shift for personalized ads recommendations](https://engineering.fb.com/wp-content/uploads/2022/11/Eng-Blog-Self-Serve-Hero-Images-DEBUGGING-203-.jpg?w=580&h=326&crop=1)\\\\\n\\\\\nPrev\\\\\n\\\\\nSequence learning: A paradigm shift for personalized ads recommendations](https://engineering.fb.com/2024/11/19/data-infrastructure/sequence-learning-personalized-ads-recommendations/) [![Powering AI innovation by acccelerating the next wave of nuclear](https://engineering.fb.com/wp-content/uploads/2024/12/AdobeStock_981369621.webp?w=580&h=326&crop=1)\\\\\n\\\\\nNext\\\\\n\\\\\nPowering AI innovation by acccelerating the next wave of nuclear](https://sustainability.atmeta.com/blog/2024/12/03/accelerating-the-next-wave-of-nuclear-to-power-ai-innovation/)\n\n### Read More in ML Applications\n\n[View All](https://engineering.fb.com/category/ml-applications/)\n\n![](https://engineering.fb.com/wp-content/uploads/2025/11/Meta-Zoomer-Hero.png?w=580&h=326&crop=1)\n\n![](https://engineering.fb.com/wp-content/uploads/2025/11/MTP80_FBLI_1200_630-2-up-new.png?w=580&h=326&crop=1)\n\n![](https://engineering.fb.com/wp-content/uploads/2025/11/Meta-Generative-Ads-Model-GEM-Hero.png?w=580&h=326&crop=1)\n\n![](https://engineering.fb.com/wp-content/uploads/2025/10/Meta-data-center-interior-Hero-1.jpg?w=580&h=326&crop=1)\n\n![](https://engineering.fb.com/wp-content/uploads/2025/10/Meta-OCP-2025-NSF-1.png?w=580&h=326&crop=1)\n\n![](https://engineering.fb.com/wp-content/uploads/2023/09/Eng-Blog-Self-Serve-Hero-Images-DEBUGGING-202-Navy.jpg?w=580&h=326&crop=1)\n\n### Available Positions\n\n* * *\n\n- [Software Engineer, Product\\\\\n\\\\\n\\\\\nSUNNYVALE, US](https://www.metacareers.com/jobs/727671609895617/)\n- [Software Engineer, Product\\\\\n\\\\\n\\\\\nSAN MATEO, US](https://www.metacareers.com/jobs/727671609895617/)\n- [Software Engineer, Product\\\\\n\\\\\n\\\\\nLOS ANGELES, US](https://www.metacareers.com/jobs/727671609895617/)\n- [Software Engineer, Product\\\\\n\\\\\n\\\\\nBELLEVUE, US](https://www.metacareers.com/jobs/727671609895617/)\n- [Software Engineer, Product\\\\\n\\\\\n\\\\\nREDMOND, US](https://www.metacareers.com/jobs/727671609895617/)\n\n[See All Jobs](https://www.metacareers.com/)\n\n### Technology at Meta\n\n- ![footer-fb-engineering](https://engineering.fb.com/wp-content/themes/code-fb-com/img/meta_logo.png)\n\n\n\nEngineering at Meta - X\n\n\n\nFollow\n\n\n- ![footer-AI](https://engineering.fb.com/wp-content/themes/code-fb-com/img/meta_logo.png)\n\n\n\nAI at Meta\n\n\n[Read](https://ai.meta.com/blog/)\n\n- ![footer-developers](https://engineering.fb.com/wp-content/themes/code-fb-com/img/meta_logo.png)\n\n\n\nMeta Quest Blog\n\n\n[Read](https://www.meta.com/blog/quest/)\n\n- ![footer-developers](https://engineering.fb.com/wp-content/themes/code-fb-com/img/meta_logo.png)\n\n\n\nMeta for Developers\n\n\n[Read](https://developers.facebook.com/)\n\n- ![footer-bug-bounty](https://engineering.fb.com/wp-content/themes/code-fb-com/img/meta_logo.png)\n\n\n\nMeta Bug Bounty\n\n\n[Learn more](https://bugbounty.meta.com/)\n\n- ![footer-rss](https://engineering.fb.com/wp-content/themes/code-fb-com/img/rss.png)\n\n\n\nRSS\n\n\n[Subscribe](https://code.facebook.com/posts/rss/)\n\n\n### Open Source\n\nMeta believes in building community through open source technology. Explore our latest projects in Artificial Intelligence, Data Infrastructure, Development Tools, Front End, Languages, Platforms, Security, Virtual Reality, and more.\n\n- ![android](https://engineering.fb.com/wp-content/themes/code-fb-com/img/android.png)\n\nANDROID\n\n\n- ![ios](https://engineering.fb.com/wp-content/themes/code-fb-com/img/ios.png)\n\niOS\n\n\n- ![web](https://engineering.fb.com/wp-content/themes/code-fb-com/img/web.png)\n\nWEB\n\n\n- ![backend](https://engineering.fb.com/wp-content/themes/code-fb-com/img/backend.png)\n\nBACKEND\n\n\n- ![hardware](https://engineering.fb.com/wp-content/themes/code-fb-com/img/hardware.png)\n\nHARDWARE\n\n\n\nLearn More\n\nTo help personalize content, tailor and measure ads and provide a safer experience, we use cookies. By clicking or navigating the site, you agree to allow our collection of information on and off Facebook through cookies. Learn more, including about available controls: [Cookie Policy](https://engineering.fb.com/privacy)\n\nAccept"
    },
    "is_pinned": false,
    "is_archived": false,
    "created_at": "2025-11-26T12:39:18.834955+00:00",
    "updated_at": "2025-11-28T08:00:20.306163+00:00",
    "google_file_name": null,
    "google_store_id": null,
    "indexing_status": "indexed",
    "google_error": null,
    "google_search_indexed": true,
    "google_search_indexed_at": "2025-11-28T08:00:20.123+00:00"
  },
  {
    "id": "010be242-50ae-4a1f-8ffd-80f69b6f79e4",
    "user_id": "3f56efc4-d548-4696-9a8a-aa636a60c5eb",
    "scope": "client",
    "client_id": "techstart-solutions",
    "project_id": null,
    "task_id": null,
    "source_department": "marketing",
    "category": "research",
    "title": "Prompt Engineer Response",
    "description": "Error: Failed to fetch",
    "tags": [
      "agent:prompt-engineer",
      "department:marketing"
    ],
    "file_path": null,
    "external_url": null,
    "file_name": null,
    "file_size": null,
    "mime_type": null,
    "metadata": {
      "agent_name": "Prompt Engineer",
      "exchange_type": "n8n-webhook",
      "agent_config_id": "6531abf5-eb02-414a-bd0b-386622c28698"
    },
    "is_pinned": false,
    "is_archived": false,
    "created_at": "2025-11-26T18:37:45.48272+00:00",
    "updated_at": "2025-11-28T08:00:20.649705+00:00",
    "google_file_name": null,
    "google_store_id": null,
    "indexing_status": "indexed",
    "google_error": null,
    "google_search_indexed": true,
    "google_search_indexed_at": "2025-11-28T08:00:20.465+00:00"
  },
  {
    "id": "e1021eb7-6334-458d-a64b-314a3b800d12",
    "user_id": "3f56efc4-d548-4696-9a8a-aa636a60c5eb",
    "scope": "client",
    "client_id": "techstart-solutions",
    "project_id": null,
    "task_id": null,
    "source_department": "marketing",
    "category": "research",
    "title": "Prompt Engineer Response",
    "description": "Error: Edge Function returned a non-2xx status code",
    "tags": [
      "agent:prompt-engineer",
      "department:marketing"
    ],
    "file_path": null,
    "external_url": null,
    "file_name": null,
    "file_size": null,
    "mime_type": null,
    "metadata": {
      "agent_name": "Prompt Engineer",
      "exchange_type": "n8n-webhook",
      "agent_config_id": "6531abf5-eb02-414a-bd0b-386622c28698"
    },
    "is_pinned": false,
    "is_archived": false,
    "created_at": "2025-11-26T18:59:24.988755+00:00",
    "updated_at": "2025-11-28T08:00:20.975833+00:00",
    "google_file_name": null,
    "google_store_id": null,
    "indexing_status": "indexed",
    "google_error": null,
    "google_search_indexed": true,
    "google_search_indexed_at": "2025-11-28T08:00:20.806+00:00"
  }
]